#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_password.api_auth_token: Refreshing state... [id=none]
data.archive_file.lambda_package: Reading...
aws_acm_certificate.public_domain: Refreshing state... [id=arn:aws:acm:us-east-1:757214766189:certificate/67c6f555-de6c-4477-9538-291b3951e794]
aws_dynamodb_table.matching_table: Refreshing state... [id=chrred-link-shortener-test-link-matching]
data.aws_route53_zone.domain: Reading...
data.aws_iam_policy_document.lambda_permissions: Reading...
data.aws_iam_policy_document.lambda: Reading...
data.aws_iam_policy_document.lambda_logging: Reading...
aws_api_gateway_rest_api.monolith: Refreshing state... [id=0kukkun007]
data.aws_iam_policy_document.lambda_permissions: Read complete after 0s [id=3686425637]
data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=4224822605]
data.aws_iam_policy_document.lambda: Read complete after 0s [id=2690255455]
aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::757214766189:policy/chrred-link-shortener-test-lambda-permissions]
aws_iam_role.lambda: Refreshing state... [id=chrred-link-shortener-test-lambda]
aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::757214766189:policy/chrred-link-shortener-test-lambda-logging]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=chrred-link-shortener-test-lambda-20230423112019860300000002]
aws_iam_role_policy_attachment.lambda: Refreshing state... [id=chrred-link-shortener-test-lambda-20230423112019855600000001]
data.archive_file.lambda_package: Read complete after 1s [id=bd4650cd042a0fab864c6c63f7868535d6138eb5]
data.aws_route53_zone.domain: Read complete after 1s [id=Z00139661AMAXF6LLDC28]
aws_route53_record.public_domain["test.chr.red"]: Refreshing state... [id=Z00139661AMAXF6LLDC28__f3223d821cda46ca8a7226e39036d050.test.chr.red._CNAME]
aws_api_gateway_resource.root_proxy: Refreshing state... [id=tizzw6]
aws_acm_certificate_validation.public_domain: Refreshing state... [id=2023-04-23 11:20:36.537 +0000 UTC]
aws_api_gateway_method.root_proxy_any: Refreshing state... [id=agm-0kukkun007-tizzw6-ANY]
aws_api_gateway_method.root_proxy_options: Refreshing state... [id=agm-0kukkun007-tizzw6-OPTIONS]
aws_api_gateway_domain_name.stack_root_domain: Refreshing state... [id=test.chr.red]
aws_api_gateway_method_response.root_proxy_any_200: Refreshing state... [id=agmr-0kukkun007-tizzw6-ANY-200]
aws_api_gateway_method_response.root_proxy_options_200: Refreshing state... [id=agmr-0kukkun007-tizzw6-OPTIONS-200]
aws_api_gateway_integration.root_proxy_options_mock: Refreshing state... [id=agi-0kukkun007-tizzw6-OPTIONS]
aws_lambda_function.monolith: Refreshing state... [id=chrred-link-shortener-test-monolith]
aws_route53_record.root_domain_mapping: Refreshing state... [id=Z00139661AMAXF6LLDC28_test.chr.red_A]
aws_api_gateway_integration_response.root_proxy_options_200: Refreshing state... [id=agir-0kukkun007-tizzw6-OPTIONS-200]
aws_api_gateway_integration_response.root_proxy_options_mock: Refreshing state... [id=agir-0kukkun007-tizzw6-OPTIONS-200]
aws_lambda_permission.api_gateway_invocation: Refreshing state... [id=AllowExecutionFromApiGateway]
aws_api_gateway_integration.root_proxy: Refreshing state... [id=agi-0kukkun007-tizzw6-ANY]
aws_api_gateway_deployment.monolith: Refreshing state... [id=lzqhon]
aws_api_gateway_integration_response.root_proxy_any_200: Refreshing state... [id=agir-0kukkun007-tizzw6-ANY-200]
aws_api_gateway_stage.monolith: Refreshing state... [id=ags-0kukkun007-v1]
aws_api_gateway_base_path_mapping.stack_root_domain: Refreshing state... [id=test.chr.red/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.monolith will be updated in-place
  ~ resource "aws_lambda_function" "monolith" {
        id                             = "chrred-link-shortener-test-monolith"
      ~ last_modified                  = "2024-01-12T03:10:31.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:757214766189:function:chrred-link-shortener-test-monolith:248" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:757214766189:function:chrred-link-shortener-test-monolith:248/invocations" -> (known after apply)
      ~ source_code_hash               = "Vgh6LxWnyhVl+UDOSR71c/QVo7xqQMBxsPXTZr4EuZ8=" -> "+V5S+yMIUkrBZWfO48SP1PC6rSOSCanekqbO5YXTzzo="
        tags                           = {}
      ~ version                        = "248" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Workflow: `Deployment`*